[
    {
      "id": 1,
      "title": "Derek Jeter among 18 newcomers on Hall of Fame ballot",
      "postdate": "November 24, 2019",
      "preview": "NEW YORK -- Derek Jeter is among 18 newcomers on the 2020 Hall of Fame ballot...",
      "body": "NEW YORK -- Derek Jeter is among 18 newcomers on the 2020 Hall of Fame ballot. He is likely to be an overwhelming choice to join former New York Yankees teammate Mariano Rivera in Cooperstown after the reliever last year became the first unanimous pick by the Baseball Writers' Association of America.\nA 14-time All-Star shortstop and five-time World Series champion, Jeter hit .310 with 3,465 hits in 20 seasons and was the 1996 AL Rookie of the Year. He has been CEO of the Miami Marlins the past two seasons.\nOther newcomers announced Monday by the BBWAA include Cliff Lee, Josh Beckett, Jason Giambi, Paul Konerko, Rafael Furcal, Bobby Abreu and Alfonso Soriano.",
      "postImg": "images/post_img1.jpg"
    },
    {
      "id": 2,
      "title": "Brian Cashman signals interest in Gerrit Cole, Stephen Strasburg",
      "postdate": "November 24, 2019",
      "preview": "Aces Gerrit Cole and Stephen Strasburg will be the most sought after pitching free agents this offseason...",
      "body": "Aces Gerrit Cole and Stephen Strasburg will be the most sought after pitching free agents this offseason, and the New York Yankees will be among the interested teams, general manager Brian Cashman said Monday.\nOf course, we are going to talk to Strasburg. We will talk to Cole. We will talk to the higher-end guys, clearly, and have conversations, and we will also talk about some surprise guys, I am sure, Cashman told reporters at MLB's annual general manager meetings in Scottsdale, Arizona.",
      "postImg": "images/post_img2.jpg"
    },
    {
      "id": 3,
      "title": "Yankees go high tech, turn to 34-year-old as new pitching coach",
      "postdate": "November 24, 2019",
      "preview": "SCOTTSDALE, Ariz. -- Just four years ago, Matt Blake was varsity pitching coach at Lincoln-Sudbury Regional High School...",
      "body": "SCOTTSDALE, Ariz. -- Just four years ago, Matt Blake was varsity pitching coach at Lincoln-Sudbury Regional High School, about 20 miles outside of Boston. Next spring, the 34-year-old will be guiding the high-priced arms of the New York Yankees.\nBlake replaces Larry Rothschild, who was fired after nine seasons following New York's loss to the Houston Astros in the ALCS. The Yankees formally announced the hiring Thursday.\nThe biggest thing is just finding out where the player is at, and what it is that makes him tick, Blake said. Across different ages or nationalities and cultures, you got to get to the root of what is it that they are seeking for help and then bring it to the edge of their learning zone, if you will.",
      "postImg": "images/post_img3.jpg"
    }
  ]